#pragma once
#include "StageState.h"
#include <Windows.h>

//¡á¡á¡á¡á¡á¡á¡á  ¡á¡á¡á¡á¡á¡á¡á    ¡á¡á
//¡á¡á¡á  ¡á¡á  ¡á¡á¡á  ¡á¡á    ¡á¡á
//     ¡á¡á       ¡á¡á    ¡á¡á
//   ¡á¡á¡á   ¡á¡á¡á¡á¡á¡á¡á    ¡á¡á¡á
//     ¡á¡á  ¡á¡á         ¡á¡á¡á   
//¡á¡á¡á  ¡á¡á  ¡á¡á¡á        ¡á¡á¡á
//¡á¡á¡á¡á¡á¡á¡á  ¡á¡á¡á¡á¡á¡á¡á    ¡á¡á¡á
class CountDownState : public StageState
{
	const char* img[3][7] = {
	{
		"    ¡á¡á      ",
		"    ¡á¡á      ",
		"    ¡á¡á      ",
		"    ¡á¡á¡á    ",
		"    ¡á¡á¡á    ",
		"    ¡á¡á¡á    ",
		"    ¡á¡á¡á    ",
	},
	{
		"¡á¡á¡á¡á¡á¡á¡á",
		"¡á¡á¡á    ¡á¡á",
		"        ¡á¡á",
		"¡á¡á¡á¡á¡á¡á¡á",
		"¡á¡á          ",
		"¡á¡á¡á        ",
		"¡á¡á¡á¡á¡á¡á¡á",
	},
	{
		"¡á¡á¡á¡á¡á¡á¡á",
		"¡á¡á¡á    ¡á¡á",
		"          ¡á¡á",
		"      ¡á¡á¡á  ",
		"          ¡á¡á",
		"¡á¡á¡á    ¡á¡á",
		"¡á¡á¡á¡á¡á¡á¡á"
	}
	};
	int countDown = 3;
	DWORD lastTick = 0;
public:
	CountDownState();
	void Update(Stage* stage) override;
};

